DecideMe/app/controllers/picpolls_controller.rb

	def index
		@picpolls= Picpoll.all.reverse
---
SELECT "picpolls".* FROM "picpolls"

	def show
		@picpoll=Picpoll.find(params[:id])
---
SELECT  "picpolls".* FROM "picpolls" WHERE "picpolls"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@picpoll=current_user.picpolls.build(pic_params)
		respond_to do |format|
		if @picpoll.save
---
INSERT INTO "picpolls" ("title", "message", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "image_one_file_name", "image_one_content_type", "image_one_file_size", "image_one_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def destroy
		@picpoll =Picpoll.find(params[:id])
		@picpoll.destroy
---
SELECT  "picpolls".* FROM "picpolls" WHERE "picpolls"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "picpolls" WHERE "picpolls"."id" = ?  [["id", 1]]