DecideMe/app/controllers/polls_controller.rb

	def index
		@textpolls= Textpoll.all.reverse
		@picpolls=Picpoll.all.reverse
---
SELECT "textpolls".* FROM "textpolls"
SELECT "picpolls".* FROM "picpolls"