DecideMe/app/controllers/textpolls_controller.rb

SELECT "textpolls".* FROM "textpolls"
---
	def index
		@textpolls= Textpoll.all.reverse

SELECT  "textpolls".* FROM "textpolls" WHERE "textpolls"."id" = ? LIMIT 1  [["id", 0]]
---
	def show
		@textpoll=Textpoll.find(params[:id])

INSERT INTO "textpolls" ("title", "first_msg", "second_msg", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Where is my girl"], ["first_msg", "Nana"], ["second_msg", "Kate"], ["user_id", 3], ["created_at", "2015-12-04 22:34:05.168322"], ["updated_at", "2015-12-04 22:34:05.168322"]]
---
	def create
		@textpoll=current_user.textpolls.build(text_params)

		if @textpoll.save

SELECT  "textpolls".* FROM "textpolls" WHERE "textpolls"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "textpolls" WHERE "textpolls"."id" = ?  [["id", 1]]
---
	def destroy
		@textpoll =Textpoll.find(params[:id])
		@textpoll.destroy